Revit 2026 API

# HermiteSurfaceCreate(Int32, Int32, IListXYZ) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static HermiteSurface Create(
	int nU,
	int nV,
	IList<XYZ> points
)
```
```vb
Public Shared Function Create (
	nU As Integer,
	nV As Integer,
	points As IList(Of XYZ)
) As HermiteSurface
```
```cpp
public:
static HermiteSurface^ Create(
	int nU,
	int nV,
	IList<XYZ^>^ points
)
```
```fsharp
static member Create :
        nU : int *
        nV : int *
        points : IList<XYZ> -> HermiteSurface
```

#### Parameters

nU Int32

nV Int32

points IListXYZ

#### Return Value

HermiteSurface

#### Reference

HermiteSurface Class

Create Overload

Autodesk.Revit.DB Namespace